src/Catalogs/КомандыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КомандыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КомандыПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивОбработчиков(пКоманда) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомандыПроцессовОбработчики.Обработчик
	               |ИЗ
	               |	Справочник.КомандыПроцессов.Обработчики КАК КомандыПроцессовОбработчики
	               |ГДЕ
	               |	КомандыПроцессовОбработчики.Ссылка = &Команда
	               |	И КомандыПроцессовОбработчики.Обработчик.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КомандыПроцессовОбработчики.НомерСтроки";
	
	Запрос.УстановитьПараметр("Команда", пКоманда );
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции	//ПолучитьМассивОбработчиков

Функция ПолучитьМассивТекстовОбработчиков(пКоманда) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомандыПроцессовОбработчики.Обработчик.Алгоритм КАК Алгоритм 
	               |ИЗ
	               |	Справочник.КомандыПроцессов.Обработчики КАК КомандыПроцессовОбработчики
	               |ГДЕ
	               |	КомандыПроцессовОбработчики.Ссылка = &Команда
	               |	И КомандыПроцессовОбработчики.Обработчик.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КомандыПроцессовОбработчики.НомерСтроки";
	
	Запрос.УстановитьПараметр("Команда", пКоманда );
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции	//ПолучитьМассивОбработчиков

#КонецЕсли
